app/controllers/api_controller.rb

SELECT "clippings".* FROM "clippings" ORDER BY "clippings".id DESC
---
	def all
		@clippings = Clipping.all

INSERT INTO "clippings" ("content", "created_at", "updated_at") VALUES (?, ?, ?)  [["content", "yo"], ["created_at", Sat, 05 Oct 2013 22:42:00 UTC +00:00], ["updated_at", Sat, 05 Oct 2013 22:42:00 UTC +00:00]]
SELECT "clippings".* FROM "clippings" ORDER BY "clippings".id DESC
---
	def create
		unless params[:content].nil?
			clipping = Clipping.create(:content => params[:content])
			clipping.save!
		end

		@clippings = Clipping.all