app/controllers/home_controller.rb

  def index
  	@clippings = Clipping.all
---
SELECT "clippings".* FROM "clippings"